Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: The header to issue if the help output has a section for miscellaneous help topics (that is, there are :meth:`help_\*` methods without corresponding :meth:`do_\*` methods).
pl: Nagłówek do przekazania jeśli wyjście pomocy ma rozdział dla szczególnych treści pomocy (to jest, istnieją sposoby postępowania :meth:`help_\*`, bez odpowiadających sposobów postępowania :meth:`do_\*`).

source: The header to issue if the help output has a section for undocumented commands (that is, there are :meth:`do_\*` methods without corresponding :meth:`help_\*` methods).
pl: Nagłówek do przekazania jeśli wyjście pomocy ma rozdział dla nieudokumentowanych poleceń (to jest, istnieją sposoby postępowania :meth:`do_\*` bez odpowiadających sposobów postępowania :meth:`help_\*`).

source: The character used to draw separator lines under the help-message headers. If empty, no ruler line is drawn. It defaults to ``'='``.
pl: Znak używany aby rysować linie separatora pod nagłówkami wiadomości-pomocy. Jeśli pusty żadna linia oddzielająca nie jest rysowana. Domyślnie równa jest ``'='``.

source: A flag, defaulting to true. If true, :meth:`cmdloop` uses :func:`input` to display a prompt and read the next command; if false, :meth:`sys.stdout.write` and :meth:`sys.stdin.readline` are used. (This means that by importing :mod:`readline`, on systems that support it, the interpreter will automatically support :program:`Emacs`\ -like line editing and command-history keystrokes.)
pl: Flaga domyślnie równa prawdzie. Jeśli prawdziwa sposób postępowania :meth:`cmdloop` używa zadania :func:`input` aby wyświetlić zapytanie i wczytać następne polecenie; jeśli fałszywa sposoby postępowania :meth:`sys.stdout.write` i :meth:`sys.stdin.readline` są używane. (To oznacza że przez importowanie :mod;`readline`, na systemach które wspierają go, interpreter automatycznie wspiera :program:`Emacs`\ -o-podobne edycje linii i naciśnięcia przycisków historii-poleceń.)

source: :mod:`code` --- Interpreter base classes
pl: :mod:`code` --- uogólnienia bazowe interpretera poleceń

source: The ``code`` module provides facilities to implement read-eval-print loops in Python. Two classes and convenience functions are included which can be used to build applications which provide an interactive interpreter prompt.
pl: Moduł ``code`` dostarcza urządzeń do wypełnienia pętli read-eval-print - wczytaj-oblicz-drukuj w języku pytonowskim. Dwa uogólnienia i zadania użytkowe są zawarte, które mogą być użyte do budowania aplikacji które dostarczają współdziałający z użytkownikiem program interpretujący polecenia.

source: This class deals with parsing and interpreter state (the user's namespace); it does not deal with input buffering or prompting or input file naming (the filename is always passed in explicitly). The optional *locals* argument specifies the dictionary in which code will be executed; it defaults to a newly created dictionary with key ``'__name__'`` set to ``'__console__'`` and key ``'__doc__'`` set to ``None``.
pl: To uogólnienie zajmuje się wczytywaniem i stanem programu interpretującego (przestrzeni nazw użytkownika); nie zajmuje się ono przestrzenią wymiany wejścia czy zapytywaniem czy też nazywaniem pliku wejściowego (nazwa pliku zawsze przekazywana jest jawnie). Opcjonalny parametr *locals* określa słownik w którym kod będzie wykonywany; Domyślnie równe jest nowo utworzonemu słownikowi z kluczem ``'__name__'`` ustawionym na ``'__console__'`` i kluczem ``'__doc__'`` ustawionym na ``None``.

source: Closely emulate the behavior of the interactive Python interpreter. This class builds on :class:`InteractiveInterpreter` and adds prompting using the familiar ``sys.ps1`` and ``sys.ps2``, and input buffering.
pl: Blisko emuluj zachowanie współdziałającego z użytkownikiem programu interpretującego polecenia języka pytonowskiego. To uogólnienie buduje na uogólnieniu :class:`InteractiveInterpreter` i dodaje zapytania używając znajomego ``sys.ps1`` i ``sys.ps2``, i przestrzeni wymiany wejścia.

source: Convenience function to run a read-eval-print loop. This creates a new instance of :class:`InteractiveConsole` and sets *readfunc* to be used as the :meth:`raw_input` method, if provided. If *local* is provided, it is passed to the :class:`InteractiveConsole` constructor for use as the default namespace for the interpreter loop. The :meth:`interact` method of the instance is then run with *banner* passed as the banner to use, if provided. The console object is discarded after use.
pl: Zadanie - udogodnienie - do uruchamiania pętli wczytaj-oblicz-drukuj. To tworzy nowy przykład uogólnienia :class:`InteractiveConsole` i ustawia *readfunc* aby było użyte przez sposób postępowania :meth:`raw_input`, jeśli dostarczono. Jeśli *local* jest dostarczony, jest przekazywany do konstruktora uogólnienia :class:`InteractiveConsole` dla użycia jako domyślna przestrzeń nazw dla pętli programu interpretującego polecenia. Sposób postępowania :meth:`interact` dla przykładu jest wtedy uruchamiany z *bannerem* przekazywanym jako banner do użycia, jeśli dostarczono. Przedmiot konsoli jest odrzucany po użyciu.

source: This function is useful for programs that want to emulate Python's interpreter main loop (a.k.a. the read-eval-print loop). The tricky part is to determine when the user has entered an incomplete command that can be completed by entering more text (as opposed to a complete command or a syntax error). This function *almost* always makes the same decision as the real interpreter main loop.
pl: To zadanie jest użyteczne dla programów, które chcą emulować główną pętlę interpretatora poleceń języka pytonowskiego (inaczej znanego jako pętla wczytaj-oblicz-drukuj). Trudną częścią jest określenie gdy użytkownik wprowadził niepełne polecenie, które może być uzupełnione przez wpisanie większej ilości tekstu (w przeciwieństwie do kompletnego polecenia lub błędu składniowego). To zadanie *prawie* zawsze wykonuje te same decyzje jako pętla główna prawdziwego programu interpretującego polecenia.

source: *source* is the source string; *filename* is the optional filename from which source was read, defaulting to ``'<input>'``; and *symbol* is the optional grammar start symbol, which should be either ``'single'`` (the default) or ``'eval'``.
pl: *źródło* - z ang. - *source* jest ciągiem źródła; *filename* - z ang. - *nazwa pliku* jest opcjonalną nazwą pliku z którego źródło zostało wczytane, domyślnie równe ``'<input>'``; i *symbol* jest opcjonalnym gramatycznym symbolem początkowym, który powinien być albo ``'pojedynczym'`` - z ang. - ``'single'`` (domyślnie) albo ``'eval'`` - z ang. - ``'obliczonym'``.

source: Returns a code object (the same as ``compile(source, filename, symbol)``) if the command is complete and valid; ``None`` if the command is incomplete; raises :exc:`SyntaxError` if the command is complete and contains a syntax error, or raises :exc:`OverflowError` or :exc:`ValueError` if the command contains an invalid literal.
pl: Zwraca przedmiot kodu (ten sam jak ``compile(source, filename, symbol)``) jeśli polecenie jest kompletne i poprawne; ``None`` jeśli polecenie jest niekompletne; zgłasza :exc:`SyntaxError` jeśli polecenie jest kompletne i zawiera błąd składniowy, lub zgłasza :exc:`OverflowError` lub :exc:`ValueError` jeśli polecenie zawiera niewłaściwą wartość.

source: Interactive Interpreter Objects
pl: Przedmioty współdziałającego z użytkownikiem programu interpreteującego polecenia.

source: Compile and run some source in the interpreter. Arguments are the same as for :func:`compile_command`; the default for *filename* is ``'<input>'``, and for *symbol* is ``'single'``. One several things can happen:
pl: Skompiluj i uruchom pewne źródło w programie interpretującym. Parametry są te same co dla zadania :func:`compile_command`; domyślnie dla *nazwy pliku* - z ang. - *filename* jest ``'<input>'``, i dla *symbolu* jest ``'single'``. Jedno z kilku rzeczy może się zdarzyć:

source: The input is incorrect; :func:`compile_command` raised an exception (:exc:`SyntaxError` or :exc:`OverflowError`). A syntax traceback will be printed by calling the :meth:`showsyntaxerror` method. :meth:`runsource` returns ``False``.
pl: Wejście jest nieprawidłowe; :func:`compile_command` zgłosiła wyjątek (:exc:`SyntaxError` lub :exc:`OverflowError`). Składniowy wypis śledzenia zostanie wydrukowany przez wywołanie sposobu postępowania :meth:`showsyntaxerror`. Sposób postępowania :meth:`runsource` zwraca ``Fałsz``.

source: The input is incomplete, and more input is required; :func:`compile_command` returned ``None``. :meth:`runsource` returns ``True``.
pl: Wejście jest niekompletne, więcej wpisów wejścia jest oczekiwane; zadanie :func:`compile_command` zwraca ``None``. :meth:`runsource` zwraca ``Prawdę`` - z ang. - ``True``.

source: The input is complete; :func:`compile_command` returned a code object. The code is executed by calling the :meth:`runcode` (which also handles run-time exceptions, except for :exc:`SystemExit`). :meth:`runsource` returns ``False``.
pl: Wejście jest kompletne; :func:`compile_command` zwróciło przedmiot kodu. Kod jest wykonywany przez uruchomienie sposobu postępowania :meth:`runcode` (co także obsługuje wyjątki czasu-wykonania, z wyjątkiem dla :exc:`SystemExit`). Sposób postępowania :meth:`runsource` zwraca ``Fałsz``.

source: The return value can be used to decide whether to use ``sys.ps1`` or ``sys.ps2`` to prompt the next line.
pl: Wartość zwracana może być użyta dla zdecydowania czy używać ``sys.ps1`` lub ``sys.ps2`` aby zapytać o następną linię.

source: Execute a code object. When an exception occurs, :meth:`showtraceback` is called to display a traceback. All exceptions are caught except :exc:`SystemExit`, which is allowed to propagate.
pl: Wykonaj przedmiot kodu. Gdy wyjątek nastąpi, :meth:`showtraceback` jest wywoływane aby wyświetlić wypis śladu. Wszystkie wyjątki są łapane z oprócz :exc:`SystemExit`, który ma pozwolenie na propagację.

source: A note about :exc:`KeyboardInterrupt`: this exception may occur elsewhere in this code, and may not always be caught. The caller should be prepared to deal with it.
pl: Zauważ o :exc:`KeyboardInterrupt`: ten wyjątek może nastąpić gdziekolwiek indziej w tym kodzie i może nie zawsze być złapany. Wywołujący powinien być przygotowany aby sobie z tym radzić.

source: Display the syntax error that just occurred. This does not display a stack trace because there isn't one for syntax errors. If *filename* is given, it is stuffed into the exception instead of the default filename provided by Python's parser, because it always uses ``'<string>'`` when reading from a string. The output is written by the :meth:`write` method.
pl: Wyświetl błąd który właśnie nastąpił. To nie wyświetla wypisu śladu ze sterty ponieważ nie istnieje taki dla błędu składniowego. Jeśli *nazwa pliku* jest dana, jest ona wepchnięta w wyjątek zamiast domyślnej nazwy pliku dostarczonej przez czytnik języka Pytonowskiego, ponieważ to zawsze używa ``'<string>'`` gdy czytane jest z ciągu znaków. Wyjście jest zapisywane przez sposób postępowania :meth:`write`.

source: Display the exception that just occurred. We remove the first stack item because it is within the interpreter object implementation. The output is written by the :meth:`write` method.
pl: Wyświetl wyjątek który właśnie nastąpił. Zdejmujemy pierwszy element sterty ponieważ jest on wewnątrz wypełnienia przedmiotu interpretatora. Wyjście jest zapisywane przez sposób postępowania :meth:`write`.

source: Write a string to the standard error stream (``sys.stderr``). Derived classes should override this to provide the appropriate output handling as needed.
pl: Zapisz ciąg znaków do standardowego strumienia błędów (``sys.stderr``). Pochodne uogólnienia powinny przesłaniać to dla dostarczenia odpowiedniej obsługi wyjścia, jak potrzeba.

source: Interactive Console Objects
pl: Przedmioty współdziałającej z użytkownikiem konsoli

source: The :class:`InteractiveConsole` class is a subclass of :class:`InteractiveInterpreter`, and so offers all the methods of the interpreter objects as well as the following additions.
pl: Uogólnienie :class:`InteractiveConsole` jest podrzędnym uogólnieniem względem :class:`InteractiveInterpreter`, i tak oferuje wszystkie sposoby postępowania przedmiotów interpretera zarówno jak też następujące dodatki.

source: Closely emulate the interactive Python console. The optional banner argument specify the banner to print before the first interaction; by default it prints a banner similar to the one printed by the standard Python interpreter, followed by the class name of the console object in parentheses (so as not to confuse this with the real interpreter -- since it's so close!).
pl: Blisko emuluj współdziałającą z użytkownikiem konsolę języka Pytonowskiego. Opcjonalny parametr banner określa banner do wydrukowania przed pierwszym współdziałaniem z użytkownikiem; domyślnie drukuje to banner podobny do jednego drukowanego przez standardowy interpreter języka pytonowskiego, po którym następuje nazwa przedmiotu konsoli w nawiasach (tak aby nie pomylić tego z rzeczywistym interpreterem -- gdyż jest on tak bliski!).

source: Push a line of source text to the interpreter. The line should not have a trailing newline; it may have internal newlines. The line is appended to a buffer and the interpreter's :meth:`runsource` method is called with the concatenated contents of the buffer as source. If this indicates that the command was executed or invalid, the buffer is reset; otherwise, the command is incomplete, and the buffer is left as it was after the line was appended. The return value is ``True`` if more input is required, ``False`` if the line was dealt with in some way (this is the same as :meth:`runsource`).
pl: Popchnij linię tekstu źródłowego dla interpretatora. Linia nie powinna mieć kończącego znaku nowego wiersza. Linia jest dopisywana do przestrzeni wymiany, a sposób postępowania :meth:`runsource` programu interpretującego polecenia języka pytonowskiego jest wywoływany z połączonych zawartości z przestrzeni wymiany jako źródło. Jeśli to wskazuje, że komenda została wykonana lub niewłaściwa, przestrzeń wymiany jest resetowana; w przeciwnym razie, polecenie jest niekompletne, a przestrzeń wymiany jest pozostawiana tak jak była po tym jak linia została dopisana. Wartość zwracana jest ``Prawdziwa`` jeśli więcej wejścia jest wymagane, ``Fałszywa`` jeśli linia została obsłużona w pewien sposób (to jest tym samym jak :meth:`runsource`).

source: Remove any unhandled source text from the input buffer.
pl: Zdejmij dowolne nieobsłużone teksty źródłowe z przestrzeni wymiany wprowadzania.

source: Write a prompt and read a line. The returned line does not include the trailing newline. When the user enters the EOF key sequence, :exc:`EOFError` is raised. The base implementation reads from ``sys.stdin``; a subclass may replace this with a different implementation.
pl: Zapisz zapytanie i wczytaj linię. Zwracana linia nie zawiera kończącego znaku nowej linii. Gdy użytkownik wprowadzi sekwencję znaków EOF, :exc:`EOFError` jest zgłaszany. Bazowe wypełnienie wczytuje z ``sys.stdin``; podrzędne uogólnienie może zastąpić to innym wypełnieniem.

source: :mod:`codecs` --- Codec registry and base classes
pl: :mod:`codecs` --- rejestr kodeków i uogólnień podstawowych

source: This module defines base classes for standard Python codecs (encoders and decoders) and provides access to the internal Python codec registry which manages the codec and error handling lookup process.
pl: Ten moduł określa uogólnienia podstawowe dla standardowych kodeków języka Pytonowskiego (koderów i dekoderów) i dostarcza dostęp do wewnętrznego rejestru kodeków który zarządza kodekami i procesem podglądania obsługi błędów.

source: It defines the following functions:
pl: Definiuje to następujące zadania:

source: Register a codec search function. Search functions are expected to take one argument, the encoding name in all lower case letters, and return a :class:`CodecInfo` object having the following attributes:
pl: Rejestruje zadanie szukania kodeków. Zadania poszukiwania kodeku oczekuje się że pobiorą jeden parametr, nazwę kodowania małymi literami, i zwróci przedmiot :class:`CodecInfo` posiadający następujące właściwości:

source: ``name`` The name of the encoding;
pl: ``name`` Nazwa kodowania;

source: ``encode`` The stateless encoding function;
pl: ``encode`` Bezstanowe zadanie kodowania;

source: ``decode`` The stateless decoding function;
pl: ``decode`` Bezstanowe zadanie dekodowania;

source: ``incrementalencoder`` An incremental encoder class or factory function;
pl: ``incrementalencoder`` zwiększające uogólnienie kodowania lub zadanie fabrykujące;

source: ``incrementaldecoder`` An incremental decoder class or factory function;
pl: ``incrementaldecoder`` zwiększające uogólnienie dekodowania lub zadanie fabrykujące;

source: ``streamwriter`` A stream writer class or factory function;
pl: ``streamwriter`` zapisujące strumień uogólnienie lub zadanie fabrykujące;

source: ``streamreader`` A stream reader class or factory function.
pl: ``streamreader`` odczytujące strumień uogólnienie lub zadanie fabrykujące;

source: The various functions or classes take the following arguments:
pl: Różne zadania i uogólnienia pobierają następujące parametry:

source: *encode* and *decode*: These must be functions or methods which have the same interface as the :meth:`encode`/:meth:`decode` methods of Codec instances (see Codec Interface). The functions/methods are expected to work in a stateless mode.
pl: *koduj* i *dekoduj - z ang. - *encode* and *decode*: Te muszą być zadaniami lub sposobami postępowania, które mają ten sam sprzęg jak sposoby postępowania :meth:`encode`/:meth:`decode` przykładów kodeków (zobacz sprzęg kodeków). Zadania/ sposoby postępowania oczekuje się, że będą działać w trybie bezstanowym.

source: *incrementalencoder* and *incrementaldecoder*: These have to be factory functions providing the following interface:
pl: *incrementalencoder* i *incrementaldecoder*: Te muszą być zadaniami fabrykującymi dostarczającymi następujący sprzęg:

source: The factory functions must return objects providing the interfaces defined by the base classes :class:`IncrementalEncoder` and :class:`IncrementalDecoder`, respectively. Incremental codecs can maintain state.
pl: Zadania fabrykujące muszą zwracać przedmioty dostarczające sprzęgi określone przez uogólnienia podstawowe :class:`IncrementalEncoder` i :class:`IncrementalDecoder`, odpowiednio. Zwiększające kodeki mogą zachowywać stan.

source: *streamreader* and *streamwriter*: These have to be factory functions providing the following interface:
pl: *streamreader* i *streamwriter*: Te muszą być zadaniami fabrykującymi dostarczającymi następujący sprzęg:

source: The factory functions must return objects providing the interfaces defined by the base classes :class:`StreamWriter` and :class:`StreamReader`, respectively. Stream codecs can maintain state.
pl: Zadania fabrykujące muszą zwracać przedmioty dostarczające sprzęgi określone przez uogólnienie podstawowe :class:`StreamWriter` i :class:`StreamReader` odpowiednio. Kodeki strumieniowe mogą zachowywać stan.

source: Possible values for errors are
pl: Możliwe wartości dla błędów są:

source: ``'strict'``: raise an exception in case of an encoding error
pl: ``'strict'``: zgłoś wyjątek w przypadku błędu kodowania

source: ``'replace'``: replace malformed data with a suitable replacement marker, such as ``'?'`` or ``'\ufffd'``
pl: ``'replace'``: zamień dane z odpowiednim markerem zamiany, takim jak ``'?'`` lub ``'\ufffd'``

source: ``'ignore'``: ignore malformed data and continue without further notice
pl: ``'ignore'``: ignoruj źle uformowane dane i kontynuuj bez dalszych powiadomień

source: ``'xmlcharrefreplace'``: replace with the appropriate XML character reference (for encoding only)
pl: ``'xmlcharrefreplace'``: zamień na odpowiedni znak odniesienia XML (tylko dla kodowania)

source: ``'backslashreplace'``: replace with backslashed escape sequences (for encoding only)
pl: ``'backslashreplace'``: zamień na skośnikowane sekwencje ucieczkowe (jedynie dla kodowania)

source: ``'surrogateescape'``: replace with surrogate U+DCxx, see :pep:`383`
pl: ``'surrogateescape'``: zamień na surogatową U+DCxx, zobacz :pep:`383`

source: as well as any other error handling name defined via :func:`register_error`.
pl: zarówno jak też dowolne inne nazwy obsługi błędów zdefiniowanych przez :func:`register_error`.

source: In case a search function cannot find a given encoding, it should return ``None``.
pl: W przypadku gdy zadanie poszukiwania nie może znaleźć danego kodowania, powinno ono zwrócić ``None``.

source: Looks up the codec info in the Python codec registry and returns a :class:`CodecInfo` object as defined above.
pl: Podgląda informację o kodeku w rejestrze kodeków języka pytonowskiego i zwraca przedmiot :class:`CodecInfo` jak określono powyżej.

source: Encodings are first looked up in the registry's cache. If not found, the list of registered search functions is scanned. If no :class:`CodecInfo` object is found, a :exc:`LookupError` is raised. Otherwise, the :class:`CodecInfo` object is stored in the cache and returned to the caller.
pl: Kodowania są najpierw podglądane w kieszeni rejestru. Jeśli nie znaleziono, lista zadań poszukiwania jest skanowana. Jeśli żadne przedmioty :class:`CodecInfo` nie są znajdowane, wyjątek :exc:`LookupError` jest zgłaszany. W przeciwnym przypadku przedmiot :class:`CodecInfo` jest przechowywany w kieszeni i zwracany do wywołującego.

source: To simplify access to the various codecs, the module provides these additional functions which use :func:`lookup` for the codec lookup:
pl: Aby uprościć dostęp do różnych kodeków, moduł dostarcza te dodatkowe zadania które używają zadania :func:`lookup` dla podglądu kodeków:

source: Look up the codec for the given encoding and return its encoder function.
pl: Podejrzyj kodek dla danego kodowania i zwróć jego zadanie kodowania.

source: Raises a :exc:`LookupError` in case the encoding cannot be found.
pl: Zgłasza :exc:`LookupError` w przypadku gdy kodowanie nie może być znalezione.

source: Look up the codec for the given encoding and return its decoder function.
pl: Podejrzyj kodek dla danego kodowania i zwróć jego zadanie dekodowania.

source: Look up the codec for the given encoding and return its incremental encoder class or factory function.
pl: Podejrzyj kodek dla danego kodowania i zwróć jego uogólnienie zwiększające koder lub zadanie fabrykujące.

source: Raises a :exc:`LookupError` in case the encoding cannot be found or the codec doesn't support an incremental encoder.
pl: Zgłoś :exc:`LookupError` w przypadku gdy kodowanie nie może być znalezione lub gdy kodek nie wspiera zwiększającego się kodowania.

source: Look up the codec for the given encoding and return its incremental decoder class or factory function.
pl: Podejrzyj kodek dla danego kodowania i zwróć jego uogólnienie zwiększającego dekodera lub zadania fabrykującego.

source: Raises a :exc:`LookupError` in case the encoding cannot be found or the codec doesn't support an incremental decoder.
pl: Zgłasza wyjątek :exc:`LookupError` w przypadku gdy kodowanie nie może znaleźć kodowania lub kodek nie wspiera zwiększającego się dekodera.

source: Look up the codec for the given encoding and return its StreamReader class or factory function.
pl: Podejrzyj kodek dla danego kodowania i zwróć jego uogólnienie StreamReader lub zadanie fabrykujące.

source: Look up the codec for the given encoding and return its StreamWriter class or factory function.
pl: Podejrzyj kodek dla danego kodowania i zwróć jego uogólnienie StreamWriter lub zadania fabrykującego.
